# Імпортуємо модуль re для роботи з регулярними виразами
import re

# Задаэмо функцію для якої параметром є телефонний номер у різноманітному форматі
def normalize_phone(phone_number):
    
    # За допомогою методу re.sub виконуємо очистку номеру від зайвих символів, пробілів
    cleaned_number = re.sub('[^0-9+]', "", phone_number)
    
    # для перевірки присутності міжнарадного коду у номері використовуємо умовний оператор
    # спочатку перевіряємо відсутність плюсу
    if not cleaned_number.startswith("+"):
        
        # якщо плюсу нема перевіряємо чи є 38
        if cleaned_number.startswith("38"):
            
            # ящо 38 є то просто додаємо + до номеру
            cleaned_number = "+" + cleaned_number
        
        # якщо не виконуються попередні умови додаємо все одразу +38 
        else:
            cleaned_number = "+38" + cleaned_number
    
    # повертаємо очищений номер 
    return cleaned_number 

# Перевірка роботи функції
raw_numbers = [
    "067\\t123 4567",
    "(095) 234-5678\\n",
    "+380 44 123 4567",
    "380501234567",
    "    +38(050)123-32-34",
    "     0503451234",
    "(050)8889900",
    "38050-111-22-22",
    "38050 111 22 11   ",
]

sanitized_numbers = [normalize_phone(num) for num in raw_numbers]
print("Нормалізовані номери телефонів для SMS-розсилки:", sanitized_numbers)
